wozlol/arduinoboy-RP2040-USB_MIDI_Host/Arduinoboy.ino
/***************************************************************************
 ***************************************************************************
 *                         __      _             __                        *
 *         ____ __________/ /_  __(_)___  ____  / /_  ____  __  __         *
 *        / __ `/ ___/ __  / / / / / __ \/ __ \/ __ \/ __ \/ / / /         *
 *       / /_/ / /  / /_/ / /_/ / / / / / /_/ / /_/ / /_/ / /_/ /          *
 *       \__,_/_/   \__,_/\__,_/_/_/ /_/\____/_.___/\____/\__, /           *
 *                                                       /____/            *
 *                                                                         *
 ***************************************************************************
 ***************************************************************************
 *                                                                         *
 * Version: 1.3.5 - RP2040 USB MIDI device and host update                 *
 * Date:    April 29 2026                                                  *
 * Name:    Joseph Wozniak                                                 *
 * Email:   woz@woz.lol                                                    *
 *                                                                         *
 * Adds RP2040 / Arduino-Pico support, built-in USB MIDI device support,   *
 * and PIO-USB host support for class-compliant USB MIDI keyboards.        *
 * (tested only on the RP2040 Zero module)                                 *
 *                                                                         *
 * Previous version: 1.3.4 - Modified by Entropy Electronics for ProMicro  *
 * Date:    May 19 2020                                                    *
 * Original author: Timothy Lamb                                           *
 * Email:   trash80@gmail.com                                              *
 *                                                                         *
 ***************************************************************************
 ***************************************************************************
 *                                                                         *
 * NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE NOTICE   *
 *                                                                         *
 *  https://github.com/trash80/Arduinoboy                                  *
 *                                                                         *
 *   Arduino pin settings:  (Layout is final)                              *
 *     - 6 LEDS on pins 8 to 13                                            *
 *     - Push button on pin 3 (for selecting mode)                         *
 *     - MIDI Opto-isolator power on pin 4                                 *
 *     - Gameboy Clock line on analog in pin 0                             *
 *     - Gameboy Serial Data input on analog in pin 1                      *
 *     - Serial Data from gameboy on analog in pin 2                       *
 *                                                                         *
 *   Teensy pin settings:                                                  *
 *     - 6 LEDS on pins 23,22,21,20,4,13                                   *
 *     - Push button on pin 2 (for selecting mode)                         *
 *     - MIDI Opto-isolator power connected to +3v                         *
 *     - Gameboy Clock line on pin 16                                      *
 *     - Gameboy Serial Data input on analog in pin 17                     *
 *     - Serial Data from gameboy on analog in pin 18                      *
 *                                                                         *
 *   Teensy USB MIDI is supported                                          *
 *   Teensy LC should work but untested                                    *
 *                                                                         *
 *   RP2040 / Arduino-Pico pin settings:                                   *
 *     - 6 LEDS on GPIO pins 9,10,11,12,13,16                              *
 *     - Push button on GPIO pin 5 (for selecting mode)                    *
 *     - MIDI Opto-isolator power not used                                 *
 *     - Gameboy Clock line on GPIO pin 6                                  *
 *     - Gameboy Serial Data input on GPIO pin 7                           *
 *     - Serial Data from gameboy on GPIO pin 8                            *
 *     - USB MIDI host D+ to 22ohm resistor to GPIO pin 14                 *
 *     - USB MIDI host D- to 22ohm resistor to GPIO pin 15                 * 
 *     - USB MIDI host port requires 5V VBUS power, and two 15k resistors  *
 *     one from D+ to ground, and another from D- to ground.               * 
 *                                                                         *
 *     -IMPORTANT set CPU Speed: "240 MHz (Overclock)"                     *
 *     -NOTE use a ground wire to the usb host thicker than 30awg.         *
 *     -Twist D+ and D-, try to keep them short.                           *
 *     -The 22ohm resistors go near the RP2040.                            *
 *                                                                         *
 *   RP2040 built-in USB works as a USB MIDI device.                       *
 *   RP2040 GPIO14/GPIO15 port works as a USB MIDI host.                   *
 *                                                                         *
 * Program Information:                                                    *
 *    LSDJ Slave Mode Midi Note Effects:                                   *
 *      48 - C-2 Sends a Sequencer Start Command                           *
 *      49 - C#2 Sends a Sequencer Stop Command                            *
 *      50 - D-2 Toggles Normal Tempo                                      *
 *      51 - D#2 Toggles 1/2 Tempo                                         *
 *      52 - E-2 Toggles 1/4 Tempo                                         *
 *      53 - F-2 Toggles 1/8 Tempo                                         *
 *                                                                         *
 *    LSDJ Keyboard Mode:                                                  *
 *      48 - C-2 Mute Pu1 Off/On                                           *
 *      49 - C#2 Mute Pu2 Off/On                                           *
 *      50 - D-2 Mute Wav Off/On                                           *
 *      51 - D#2 Mute Noi Off/On                                           *
 *      52 - E-2 Livemode Cue Sequence                                     *
 *      53 - F-2 Livemode Cursor Up                                        *
 *      54 - F#2 Livemode Cursor Down                                      *
 *      55 - G-2 Livemode Cursor Left                                      *
 *      56 - G#2 Livemode Cursor Right                                     *
 *      57 - A-2 Table Up                                                  *
 *      58 - A#2 Table Down                                                *
 *      59 - B-2 Cue Table                                                 *
 *      60 - C-3 to C-8 Notes!                                             *
 *      Prgram Change to select from instrument table                      *
 *                                                                         *
 ***************************************************************************/
/***************************************************************************
 *                                                                         *
 *   This program is free software; you can redistribute it and/or modify  *
 *   it under the terms of the GNU General Public License as published by  *
 *   the Free Software Foundation; either version 2 of the License, or     *
 *   (at your option) any later version.                                   *
 *                                                                         *
 ***************************************************************************/
#define MEM_MAX 65
#define NUMBER_OF_MODES 7    //Right now there are 7 modes, Might be more in the future

//!!! do not edit these, they are the position in EEPROM memory that contain the value of each stored setting
#define MEM_CHECK 0
#define MEM_VERSION_FIRST 1
#define MEM_VERSION_SECOND 2
#define MEM_MODE 5
#define MEM_FORCE_MODE 4

